# Bài tập thực hành

Bài 1. Tạo 1 DataFrame tên 'df' từ mảng numpy array kích thước 20x5 các số nguyên có giá trị ngẫu nhiên từ 0 đến 20, với tên cột là ['c0','c1', 'c2'. 'c3', 'c4']. Hãy mô tả các thông số thống kê của 'df'. 

Bài 2. Thực hiện các thao tác sau với df:
    
    a. Hiển thị 4 entries đầu tiên và 2 entries cuối cùng của df
    b. Hiển thị 10 phần tử đầu tiên của cột "c1"
    c. Hiển thị 3 phần tử cuối cùng của cột "c1"
    d. Bổ sung 1 cột "c5" gồm dãy các số 10.
    e. Tìm phần tử có giá trị lớn nhất trong df.
    f. Xóa hàng thứ 5 và cột 'c1' của df.
 
Bài 3. Đọc file Salaries.csv vào dataframe tên df_salary và thực hiện các thao tác sau:

    a. Xem kích thước của df_salary
    b. Xem thông tin của df_salary
    c. Mô tả thống kê các thông tin của df_salary
    d. Xác định giá trị trung bình của trường thông tin lương cơ bản "BasePay"
    e. Tính tổng số tiền trả ngoài giờ "OvertimePay"
    f. Tìm tên của nhân viên có số tiền trả ngoài giờ "OvertimePay" cao nhất
    g. Tìm tên của nhân viên được trả lương "TotalPay" cao nhất
    h. Tìm nghề có mức lương cơ sở cao nhất.
    i. Có bao nhiêu nghề nghiệp trong bảng?
    j. Hãy thay thế các giá trị trống và thay thế bằng số 0.

## Bài 1

In [108]:
import pandas as pd
import numpy as np

randomValue = np.random.randint(0, 21, size=(20, 5))
columns=['c0', 'c1', 'c2', 'c3', 'c4']

# create a df
df = pd.DataFrame(randomValue, columns=columns)
df.head()

# Hiển thị thống kê mô tả cho dataframe
df.describe()

              c0         c1         c2         c3         c4
count  20.000000  20.000000  20.000000  20.000000  20.000000
mean   11.450000   9.150000  10.150000  10.400000   8.700000
std     5.345682   6.768931   6.326843   5.133994   5.903612
min     1.000000   1.000000   0.000000   1.000000   0.000000
25%     6.750000   4.000000   6.000000   6.750000   3.750000
50%    11.500000   6.500000   9.000000  10.500000   8.000000
75%    16.000000  15.500000  16.500000  14.000000  15.000000
max    19.000000  19.000000  20.000000  18.000000  19.000000

# Bài 2

In [63]:
# a. Hiển thị 4 entries đầu tiên và 2 entries cuối cùng của df
print('4 entries đầu tiên')
df.head(4)

4 entries đầu tiên

   c0  c1  c2  c3  c4
0  19   2   2   8  14
1  20   8  19   2  10
2  14  13  16   6  12
3  11   0   1  14   3

In [65]:
print('2 entries cuối cùng')
df.tail(2)

2 entries cuối cùng

    c0  c1  c2  c3  c4
18   3  16   5   5   2
19  12  12   5   3  11

In [71]:
# b. Hiển thị 10 phần tử đầu tiên của cột "c1"
print('10 phần tử đầu của cột \'c1\'')
df['c1'].head(10)

10 phần tử đầu của cột 'c1'

0     2
1     8
2    13
3     0
4     0
5    13
6     9
7    11
8     3
9    14
Name: c1, dtype: int32

In [73]:
# c. Hiển thị 3 phần tử cuối cùng của cột "c1"
print('3 phần tử cuối cùng của cột \'c1\'')
df['c1'].tail(3)

3 phần tử cuối cùng của cột 'c1'

17     4
18    16
19    12
Name: c1, dtype: int32

In [109]:
# d. Bổ sung 1 cột "c5" gồm dãy các số 10.

# tạo ra 1 array với columns = chiều dài randomValue | randomValue = 20
arr = np.full(len(randomValue), 10) # [10, 10, 10, 10, 10, 10, 10, 10, 10, 10]
df['c5'] = arr
print('df sau khi thêm cột \'c5\' với giá trị là 10', end='\n\n')
print(df)

df sau khi thêm cột 'c5' với giá trị là 10

    c0  c1  c2  c3  c4  c5
0   16   6  16  17   8  10
1   14  13  12   9   2  10
2    7   1   9   1   8  10
3   18  14   6  14   7  10
4   12   1   8  18  19  10
5    5  19  18  15  15  10
6   10  17  18  10   9  10
7   18  18   9   7  16  10
8   19  19  20  10   3  10
9   14   1  10  13   9  10
10  19  17   6  13   6  10
11  12  12  19  11   4  10
12  11   7   0  14  17  10
13   1   5   3   4   6  10
14   5   4   7   9  15  10
15  11  15   4   6   3  10
16  16   4   6  13   9  10
17   5   5   2  18   0  10
18   6   1  20   3  17  10
19  10   4  10   3   1  10

In [110]:
# e. Tìm phần tử có giá trị lớn nhất trong df.
maxValue = df.max().max()
print(f'Giá trị lớn nhất trong df: {maxValue}')

Giá trị lớn nhất trong df: 20

In [111]:
# f. Xóa hàng thứ 5 và cột 'c1' của df.
"""
drop('c1', axis=1): xóa cột 'c1', axis=1: xóa cột
drop(4, axis=0): xóa hàng thứ 5, axis=0: xóa hàng
"""
df = df.drop('c1', axis=1).drop(4, axis=0)
print('df sau khi xóa')
print(df)

df sau khi xóa
    c0  c2  c3  c4  c5
0   16  16  17   8  10
1   14  12   9   2  10
2    7   9   1   8  10
3   18   6  14   7  10
5    5  18  15  15  10
6   10  18  10   9  10
7   18   9   7  16  10
8   19  20  10   3  10
9   14  10  13   9  10
10  19   6  13   6  10
11  12  19  11   4  10
12  11   0  14  17  10
13   1   3   4   6  10
14   5   7   9  15  10
15  11   4   6   3  10
16  16   6  13   9  10
17   5   2  18   0  10
18   6  20   3  17  10
19  10  10   3   1  10

## Bài 3

In [218]:
# Đọc từ file csv vào dataframe
df_salary = pd.read_csv("data/Salaries.csv")

# a. Xem kích thước của df_salary
df_salary.size #1932502

1932502

In [219]:
# b. Xem thông tin của df_salary
df_salary.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

In [220]:
# c. Mô tả thống kê các thông tin của df_salary
df_salary.describe()

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Status
count,148654.000000,148045.000000,148650.000000,148650.000000,112491.000000,148654.000000,148654.000000,148654.000000,0.0,0.0
mean,74327.500000,66325.448840,5066.059886,3648.767297,25007.893151,74768.321972,93692.554811,2012.522643,NaN,NaN
std,42912.857795,42764.635495,11454.380559,8056.601866,15402.215858,50517.005274,62793.533483,1.117538,NaN,NaN
min,1.000000,-166.010000,-0.010000,-7058.590000,-33.890000,-618.130000,-618.130000,2011.000000,NaN,NaN
25%,37164.250000,33588.200000,0.000000,0.000000,11535.395000,36168.995000,44065.650000,2012.000000,NaN,NaN
50%,74327.500000,65007.450000,0.000000,811.270000,28628.620000,71426.610000,92404.090000,2013.000000,NaN,NaN
75%,111490.750000,94691.050000,4658.175000,4236.065000,35566.855000,105839.135000,132876.450000,2014.000000,NaN,NaN
max,148654.000000,319275.010000,245131.880000,400184.250000,96570.660000,567595.430000,567595.430000,2014.000000,NaN,NaN

In [221]:
# d. Xác định giá trị trung bình của trường thông tin lương cơ bản "BasePay"

# CASE 1: using np.average()
# nếu có giá trị NaN chuyển về 0
df_salary['BasePay'] = df_salary['BasePay'].fillna(0)

# kt xem còn có giá trị NaN hay k?
has_nan = df_salary['BasePay'].isna().any().any()

if has_nan:
    print("DataFrame có giá trị NaN.")
else:
    print("DataFrame k có giá trị NaN.")

# sử dụng numpy.average()
value = np.average(df_salary['BasePay'])
print('CASE 1 - Giá trị trung bình của trường thông tin lương cơ bản "BasePay" là: ', value)

# CASE 2: using df.mean()
avgOfBasePay = df_salary['BasePay'].mean()
print('CASE 2 - Giá trị trung bình của trường thông tin lương cơ bản "BasePay" là: ', avgOfBasePay)

DataFrame k có giá trị NaN.
CASE 1 - Giá trị trung bình của trường thông tin lương cơ bản "BasePay" là:  66053.72928807836
CASE 2 - Giá trị trung bình của trường thông tin lương cơ bản "BasePay" là:  66053.72928807836

In [222]:
# e. Tính tổng số tiền trả ngoài giờ "OvertimePay"

# CASE 1: using np.sum()
# nếu có giá trị NaN chuyển về 0
df_salary['OvertimePay'] = df_salary['OvertimePay'].fillna(0)

# kt xem còn có giá trị NaN hay k?
has_nan = df_salary['OvertimePay'].isna().any().any()

if has_nan:
    print("DataFrame có giá trị NaN.")
else:
    print("DataFrame k có giá trị NaN.")

# sử dụng numpy.average()
value = np.sum(df_salary['OvertimePay'])
print('CASE 1 - Tổng số tiền trả ngoài giờ "OvertimePay" là: ', value)

# CASE 2: using df.mean()
sumOfOvertimePay = df_salary['OvertimePay'].sum()
print('CASE 2 - Tổng số tiền trả ngoài giờ "OvertimePay" là: ', sumOfOvertimePay)

DataFrame k có giá trị NaN.
CASE 1 - Tổng số tiền trả ngoài giờ "OvertimePay" là:  753069802.1199998
CASE 2 - Tổng số tiền trả ngoài giờ "OvertimePay" là:  753069802.1199998

In [223]:
# e, Tìm tên của nhân viên có số tiền trả ngoài giờ "OvertimePay" cao nhất

# using pandas.DataFrame.idxmax()
"""
df_salary['OvertimePay'].idxmax(): trả về giá trị lớn nhất trong cột 'OvertimePay'
"""
maxValueInColumns = df_salary['OvertimePay'].idxmax()

maxSalary = df_salary.loc[maxValueInColumns, 'EmployeeName']

print('Tên của nhân viên có số tiền trả ngoài giờ "OvertimePay" cao nhất là :', maxSalary)

Tên của nhân viên có số tiền trả ngoài giờ "OvertimePay" cao nhất là : GARY JIMENEZ

In [224]:
# g. Tìm tên của nhân viên được trả lương "TotalPay" cao nhất

# using pandas.DataFrame.idxmax()
maxValueInColumns = df_salary['TotalPay'].idxmax()

maxSalary = df_salary.loc[maxValueInColumns, 'EmployeeName']

print('Tên của nhân viên được trả lương "TotalPay" cao nhất là :', maxSalary)

Tên của nhân viên được trả lương "TotalPay" cao nhất là : NATHANIEL FORD

In [225]:
# h. Tìm nghề có mức lương cơ sở cao nhất.


# using pandas.DataFrame.groupby()
"""
groupby('JobTitle'): nhóm các dữ liệu trong df theo 'JobTitle'
['BasePay'].mean(): tính giá trị trung bình
idxmax(): tìm ra giá trị lớn nhất trong giá trị trung bình vừa tính được
"""
highestOfJob = df_salary.groupby('JobTitle')['BasePay'].mean().idxmax()

print('Nghề có mức lương cơ sở cao nhất là :', highestOfJob)

Nghề có mức lương cơ sở cao nhất là : Chief of Police

In [226]:
# i. Có bao nhiêu nghề nghiệp trong bảng?

# Lấy ra ds các nghề nghiệp khác nhau
manyJob = df_salary['JobTitle'].unique()

print('Số nghề nghiệp có trong bảng là :', len(manyJob))

Số nghề nghiệp có trong bảng là : 2159

In [227]:
# j. Hãy thay thế các giá trị trống và thay thế bằng số 0.

# kt xem còn có giá trị NaN hay k?
df = df.fillna(0)

if has_nan:
    print("DataFrame có giá trị NaN.")
else:
    print("DataFrame k có giá trị NaN.")

DataFrame k có giá trị NaN.